In [3]:
import numpy as np
import pandas as pd

In [12]:
sozluk={"Istanbul":(20,10,30),"Ankara":(10,30,np.nan),"Izmir":(23,np.nan,np.nan)}
dataFrame=pd.DataFrame(sozluk)

In [29]:
dataFrame["Burdur"]=(0,5,10)

In [30]:
dataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Burdur
0        20    10.0       0
1        10    30.0       5
2        30     NaN      10

In [31]:
dataFrame.fillna(10)

   Istanbul  Ankara  Izmir  Burdur
0        20    10.0   23.0       0
1        10    30.0   10.0       5
2        30    10.0   10.0      10

## merge

In [42]:
sozluk1={"Isim":["1","2","3","4"],"Spor":["3","5","7","8"]}

In [43]:
mergeDataFrame=pd.DataFrame(sozluk1)

In [44]:
sozluk2={"Isim":["1","2","3","4"],"Kalori":[3,5,7,8]}

In [45]:
mergeDataFrame2=pd.DataFrame(sozluk2)

In [48]:
pd.merge(mergeDataFrame,mergeDataFrame2,on="Isim")

  Isim Spor  Kalori
0    1    3       3
1    2    5       5
2    3    7       7
3    4    8       8